Revit 2027 API
ConicalSurface.GetFrameOfReference Method
 Returns frame of reference associated with this ConicalSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Frame GetFrameOfReference()
Public Function GetFrameOfReference As Frame
public:
Frame^ GetFrameOfReference()
member GetFrameOfReference : unit -> Frame
Return Value
Frame
 Frame of reference associated with this ConicalSurface.
Remarks
 This is an equivalent of new Frame(Origin, XDir, YDir, Axis).
See Also
Reference
ConicalSurface Class
Autodesk.Revit.DB Namespace